--instance data disk add argument `throughput_performance` FORCENEW

terraform apply
2021/01/22 12:51:58 [WARN] Log levels other than TRACE are currently unreliable, and are supported only for backward compatibility.
  Use TF_LOG=TRACE to see Terraform's internal logs.
  ----
data.tencentcloud_images.default: Refreshing state...
data.tencentcloud_vpc_subnets.vpc: Refreshing state...
data.tencentcloud_instance_types.default: Refreshing state...
tencentcloud_instance.foo1: Refreshing state... [id=ins-dqlzf6ui]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # tencentcloud_instance.foo1 will be created
  + resource "tencentcloud_instance" "foo1" {
      + allocate_public_ip                      = false
      + availability_zone                       = "ap-guangzhou-3"
      + create_time                             = (known after apply)
      + disable_monitor_service                 = false
      + disable_security_service                = false
      + expired_time                            = (known after apply)
      + force_delete                            = false
      + id                                      = (known after apply)
      + image_id                                = "img-25szkc8t"
      + instance_charge_type                    = "POSTPAID_BY_HOUR"
      + instance_charge_type_prepaid_renew_flag = (known after apply)
      + instance_name                           = "tf-auto-test-1-1"
      + instance_status                         = (known after apply)
      + instance_type                           = "S5.SMALL4"
      + internet_charge_type                    = (known after apply)
      + internet_max_bandwidth_out              = (known after apply)
      + key_name                                = (known after apply)
      + private_ip                              = (known after apply)
      + project_id                              = 0
      + public_ip                               = (known after apply)
      + running_flag                            = true
      + security_groups                         = (known after apply)
      + subnet_id                               = "subnet-1uwh63so"
      + system_disk_id                          = (known after apply)
      + system_disk_size                        = 50
      + system_disk_type                        = "CLOUD_PREMIUM"
      + vpc_id                                  = "vpc-h70b6b49"

      + data_disks {
          + data_disk_id           = (known after apply)
          + data_disk_size         = 460
          + data_disk_type         = "CLOUD_HSSD"
          + delete_with_instance   = true
          + encrypt                = false
          + throughput_performance = 50
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

tencentcloud_instance.foo1: Creating...
tencentcloud_instance.foo1: Still creating... [10s elapsed]
tencentcloud_instance.foo1: Still creating... [20s elapsed]
tencentcloud_instance.foo1: Creation complete after 20s [id=ins-p56w4068]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.





--old state in new version
$ terraform apply
2021/01/22 20:18:42 [WARN] Log levels other than TRACE are currently unreliable, and are supported only for backward compatibility.
  Use TF_LOG=TRACE to see Terraform's internal logs.
  ----
data.tencentcloud_vpc_subnets.vpc: Refreshing state...
data.tencentcloud_instance_types.default: Refreshing state...
data.tencentcloud_images.default: Refreshing state...
tencentcloud_instance.foo1: Refreshing state... [id=ins-7pjgm3hk]





